---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
source: html/98b1850c-bb20-f566-8c52-c520c7213e82.htm
---
# RebarShapeConstraintDiameter Methods

Return the Id of the parameter associated with this constraint.